
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 20 to add, 0 to change, 16 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;16&#34;]
  * azurerm_storage_blob.b2c_config[&#34;17&#34;]
  * azurerm_storage_blob.b2c_config[&#34;18&#34;]
  * azurerm_storage_blob.b2c_config[&#34;19&#34;]
* Replace
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;10&#34;]
  * azurerm_storage_blob.b2c_config[&#34;11&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]
  * azurerm_storage_blob.b2c_config[&#34;13&#34;]
  * azurerm_storage_blob.b2c_config[&#34;14&#34;]
  * azurerm_storage_blob.b2c_config[&#34;15&#34;]
  * azurerm_storage_blob.b2c_config[&#34;2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;3&#34;]
  * azurerm_storage_blob.b2c_config[&#34;4&#34;]
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]
  * azurerm_storage_blob.b2c_config[&#34;6&#34;]
  * azurerm_storage_blob.b2c_config[&#34;7&#34;]
  * azurerm_storage_blob.b2c_config[&#34;8&#34;]
  * azurerm_storage_blob.b2c_config[&#34;9&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "97d7f655444ded5cb86b0bddfda76afa" -> "d41d8cd98f00b204e9800998ecf8427e" # forces replacement
      ~ content_type           = "text/html" -> "text/css"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "login.html" -> "css/main.css" # forces replacement
      ~ source                 = "./b2c/assets/login.html" -> "./b2c/views/css/main.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["1"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "42e8d5ee8193fbe8ef02cae2f6c172cf" -> "2d511145205655b408407beb2d25a206" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "main.css" -> "css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ source                 = "./b2c/assets/main.css" -> "./b2c/views/css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["10"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> "ff75b23964656ce28eece43f266d9f1d" # forces replacement
      ~ content_type           = "image/x-png" -> "image/svg+xml"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "govuk-icon-180.png" -> "assets/images/govuk-icon-mask.svg" # forces replacement
      ~ source                 = "./b2c/assets/govuk-icon-180.png" -> "./b2c/views/assets/images/govuk-icon-mask.svg" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["11"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> "57a05afc1fc634420a02ff0151675de0" # forces replacement
      ~ content_type           = "image/svg+xml" -> "image/x-png"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "govuk-icon-mask.svg" -> "assets/images/govuk-crest-2x.png" # forces replacement
      ~ source                 = "./b2c/assets/govuk-icon-mask.svg" -> "./b2c/views/assets/images/govuk-crest-2x.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["12"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "0c9e8639ea578c52504c066c5b805508" -> "08c923d1fcc2fe3e69e73bfbf539fa6f" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "logo_gov.png" -> "assets/images/govuk-opengraph-image.png" # forces replacement
      ~ source                 = "./b2c/assets/logo_gov.png" -> "./b2c/views/assets/images/govuk-opengraph-image.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["13"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "42e8d5ee8193fbe8ef02cae2f6c172cf" -> "eef7f360c29c4ef113b058b4d7677550" # forces replacement
      ~ content_type           = "text/css" -> "image/x-png"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "main.css" -> "assets/images/govuk-icon-512.png" # forces replacement
      ~ source                 = "./b2c/assets/main.css" -> "./b2c/views/assets/images/govuk-icon-512.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["14"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "4f23b1397bc211d0f5d3f4ca720c3901" -> "e1321ba525137ed156ed48e69369531c" # forces replacement
      ~ content_type           = "text/css" -> "image/svg+xml"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "mfa.css" -> "assets/images/favicon.svg" # forces replacement
      ~ source                 = "./b2c/assets/mfa.css" -> "./b2c/views/assets/images/favicon.svg" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.css" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["15"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "ad720484bf391450e55d8293e443e34f" -> "77bfa2d75a6f14154f13588014ee25f6" # forces replacement
      ~ content_type           = "text/html" -> "application/octet-stream"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "mfa.html" -> "assets/manifest.json" # forces replacement
      ~ source                 = "./b2c/assets/mfa.html" -> "./b2c/views/assets/manifest.json" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.html" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["16"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/bold-b542beb274-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["17"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-f591b13f7d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["18"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "94a07e06a104e76fe40583f74b204aee"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-94a07e06a1-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["19"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "affa96571d94a9ab7d95b0850b26edde"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2" -> "9509139712f25775a153a8cee0d9c736" # forces replacement
      ~ content_type           = "image/x-png" -> "text/css"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/copyright.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "copyright.png" -> "css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ source                 = "./b2c/assets/copyright.png" -> "./b2c/views/css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/copyright.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["3"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> "7c42cc5ccbfbde50efefdc697bcb4cc9" # forces replacement
      ~ content_type           = "image/x-ico" -> "application/octet-stream"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "favicon.ico" -> "js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ source                 = "./b2c/assets/favicon.ico" -> "./b2c/views/js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["4"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "0c9e8639ea578c52504c066c5b805508" -> "b20d2e74fe816b4da5e7fc6a26b54b25" # forces replacement
      ~ content_type           = "image/x-png" -> "application/octet-stream"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "logo_gov.png" -> "js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ source                 = "./b2c/assets/logo_gov.png" -> "./b2c/views/js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "e1321ba525137ed156ed48e69369531c" -> "10eba57c01166b64969aca8e9d01aa8e" # forces replacement
      ~ content_type           = "image/svg+xml" -> "text/html"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "favicon.svg" -> "template.html" # forces replacement
      ~ source                 = "./b2c/assets/favicon.svg" -> "./b2c/views/template.html" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["6"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> "bcd5768bd7721641ee71ba103bb38900" # forces replacement
      ~ content_type           = "application/octet-stream" -> "image/x-png"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "bold-affa96571d-v2.woff" -> "assets/images/govuk-crest.png" # forces replacement
      ~ source                 = "./b2c/assets/bold-affa96571d-v2.woff" -> "./b2c/views/assets/images/govuk-crest.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["7"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> "a90776c99cc9bf3d9dbe593284d6bbf6" # forces replacement
      ~ content_type           = "application/octet-stream" -> "image/x-ico"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "bold-b542beb274-v2.woff2" -> "assets/images/favicon.ico" # forces replacement
      ~ source                 = "./b2c/assets/bold-b542beb274-v2.woff2" -> "./b2c/views/assets/images/favicon.ico" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["8"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "57a05afc1fc634420a02ff0151675de0" -> "ae577696a9d0466ee2019f46ec4c684f" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "govuk-crest-2x.png" -> "assets/images/govuk-icon-180.png" # forces replacement
      ~ source                 = "./b2c/assets/govuk-crest-2x.png" -> "./b2c/views/assets/images/govuk-icon-180.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["9"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> "2c48a90c9944fc69e87574d06646f3ec" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "govuk-crest.png" -> "assets/images/govuk-icon-192.png" # forces replacement
      ~ source                 = "./b2c/assets/govuk-crest.png" -> "./b2c/views/assets/images/govuk-icon-192.png" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 20 to add, 0 to change, 16 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":740,"Program":"tfcmt","SHA1":"","Vars":{}} -->